{
  "common": {
    "name": "lorawan",
    "version": "1.16.7",
    "news": {
      "1.16.7": {
        "en": "Bugfix deleting discovered devices\nbuild in devug logging to find bug in devicename",
        "de": "Fehlerbehebung beim Löschen entdeckter Geräte\nFüge Debug-Logging hinzu, um Fehler im Gerätenamen zu finden.",
        "ru": "Исправлена ошибка удаления обнаруженных устройств.\nДобавлена отладочная запись для поиска ошибок в имени устройства.",
        "pt": "Correção de bug ao excluir dispositivos descobertos\nAdicionar registro de depuração para encontrar bugs no nome do dispositivo",
        "nl": "Bugfix voor het verwijderen van ontdekte apparaten\nBouw debug logging in om bugs in apparaatnaam te vinden",
        "fr": "Correction de bug suppression des périphériques découverts\nIntégration du journal de débogage pour trouver des bugs dans le nom du périphérique",
        "it": "Correzione bug eliminazione dispositivi scoperti\nImplementare il logging di debug per trovare bug nel nome del dispositivo",
        "es": "Corrección de errores al eliminar dispositivos descubiertos.\nImplementación de registro de depuración para encontrar errores en el nombre del dispositivo",
        "pl": "Naprawiono błąd usuwania odkrytych urządzeń.\nZaimplementowano logowanie debugowania w celu znalezienia błędu w nazwie urządzenia.",
        "uk": "Виправлено помилку видалення виявлених пристроїв.\nВбудоване відлагодження для пошуку помилки в імені пристрою.",
        "zh-cn": "修复删除已发现设备时出现的问题\n构建调试日志以查找设备名称中的错误"
      },
      "1.16.6": {
        "en": "Change detection of new Discovery from LoRaWAN devices",
        "de": "Änderung der Erkennung neuer Entdeckungen von LoRaWAN-Geräten",
        "ru": "Обнаружение изменений новых устройств LoRaWAN",
        "pt": "Detecção de novos dispositivos LoRaWAN na Descoberta",
        "nl": "Wijziging in detectie van nieuwe Discovery van LoRaWAN apparaten",
        "fr": "Détection des nouvelles découvertes des dispositifs LoRaWAN",
        "it": "Rilevamento delle nuove scoperte dei dispositivi LoRaWAN",
        "es": "Detección de cambios de nuevos dispositivos de descubrimiento de LoRaWAN",
        "pl": "Wykrywanie zmian w nowym Discovery urządzeń LoRaWAN",
        "uk": "Виявлення нових пристроїв Discovery з LoRaWAN",
        "zh-cn": "更改LoRaWAN设备的新发现检测"
      },
      "1.16.5": {
        "en": "Bugfix in notifications to Bridge (new device dicovered) => namespace not set",
        "de": "Fehlerbehebung bei Benachrichtigungen an Bridge (neues Gerät erkannt) => Namespace nicht festgelegt",
        "ru": "Исправлена ошибка в уведомлениях для моста (обнаружение нового устройства) => пространство имен не установлено",
        "pt": "Correção de bug nas notificações para Bridge (novo dispositivo descoberto) => espaço de nomes não definido",
        "nl": "Bugfix in meldingen naar Bridge (nieuw apparaat ontdekt) => namespace niet ingesteld",
        "fr": "Correction de bug dans les notifications vers le pont (nouveau périphérique découvert) => espace de noms non défini",
        "it": "Correzione di un bug nelle notifiche al Bridge (nuovo dispositivo scoperto) => namespace non impostato",
        "es": "Corrección de error en las notificaciones al puente (nuevo dispositivo descubierto) => espacio de nombres no establecido",
        "pl": "Poprawiono błąd w powiadomieniach do Bridge (nowe urządzenie zostało znalezione) => nie ustawiona przestrzeń nazw",
        "uk": "Виправлено помилку у сповіщеннях до мосту (виявлено новий пристрій) => не встановлений простір імен",
        "zh-cn": "修复了通知到桥接器的bug（发现新设备）=>命名空间未设置"
      },
      "1.16.4": {
        "en": "Bridge import foreign states till Adapter is running\nBridge delete foreign states till Adapter is running",
        "de": "Brücke importiert externe Zustände, solange der Adapter läuft.\nLösche Fremdzustände aus der Datenbank, solange der Adapter aktiv ist.",
        "ru": "Импортируйте внешние состояния моста до запуска адаптера\nУдаление внешних состояний Bridge, пока работает адаптер.",
        "pt": "Importar estados externos da ponte até que o adaptador esteja em execução\nExcluir estados estrangeiros da ponte até que o adaptador esteja em execução",
        "nl": "Importeer externe toestanden van de brug totdat de adapter actief is\nBridge verwijdert externe statussen zolang de adapter actief is",
        "fr": "Importer les états étrangers du pont tant que l'adaptateur est en cours d'exécution.\nSupprimer les états étrangers du pont tant que l'adaptateur est en cours d'exécution",
        "it": "Importa gli stati esterni del bridge finché l'adattatore è in esecuzione\nEliminazione dello stato estero del bridge fino a quando l'adattatore è in esecuzione",
        "es": "Importar estados extranjeros del puente hasta que el adaptador esté en funcionamiento.\nEliminar estados extranjeros del puente hasta que el adaptador esté en funcionamiento",
        "pl": "Importuj stany mostu do momentu uruchomienia adaptera.\nUsunięto stany obce do momentu uruchomienia adaptera.",
        "uk": "Міст імпортує зовнішні стани поки адаптер працює\nВидалення зовнішніх станів у мосту доки адаптер працює.",
        "zh-cn": "桥接器在适配器运行之前导入外部状态\n桥删除外部状态直到适配器运行"
      },
      "1.16.3": {
        "en": "nameing of foreign Devices in Bridge",
        "de": "Benennung von fremden Geräten in der Brücke",
        "ru": "Наименование иностранных устройств в мосту",
        "pt": "Nomenclatura de Dispositivos Estrangeiros na Ponte",
        "nl": "Benaming van externe apparaten in de bridge",
        "fr": "Renommage des appareils étrangers dans le pont",
        "it": "Nominativo dei dispositivi stranieri nel Bridge",
        "es": "Renombrar dispositivos extranjeros en el puente",
        "pl": "Nadanie nazw obcym urządzeniom w mostku",
        "uk": "Перейменування зовнішніх пристроїв у мосту",
        "zh-cn": "在网桥中给外部设备命名"
      },
      "1.16.2": {
        "en": "bugfix namespace also by calling work from directoryhandler",
        "de": "Bug behoben: Namensraum auch durch Aufruf von \"Arbeit\" von DirectoryHandler.",
        "ru": "исправлена ошибка с пространством имен путем вызова работы из directoryhandler",
        "pt": "Corrigido bug ao chamar namespace também utilizando o trabalho do directoryhandler.",
        "nl": "Bugfix: Namespace wordt nu ook correct opgeroepen bij het gebruik van werk van DirectoryHandler.",
        "fr": "Correction de bug du namespace également en appelant le travail du gestionnaire de répertoires.",
        "it": "Correzione di bug anche chiamando il lavoro dal gestore della directory.",
        "es": "Corrección de error en el espacio de nombres al llamar al trabajo desde directoryhandler",
        "pl": "Poprawka błędu: przestrzeń nazw również wywoływana przez funkcję work z directoryhandler",
        "uk": "виправлено помилку у просторі імен також шляхом виклику роботи з обробника директорій",
        "zh-cn": "通过调用`directoryhandler`来修复了`namespace`问题。"
      },
      "1.16.1": {
        "en": "bugfix namespace also by notifications",
        "de": "Fehlerbehebung Namespace auch bei Benachrichtigungen",
        "ru": "исправлена ошибка с пространством имён также для уведомлений",
        "pt": "Correção de bug no namespace também por notificações.",
        "nl": "bugfix namespace ook bij meldingen",
        "fr": "Correction d'un bug concernant les notifications de namespace.",
        "it": "Risolto bug anche per i namespace nelle notifiche",
        "es": "Corrección de error en el espacio de nombres también por notificaciones.",
        "pl": "naprawiono błąd z przestrzenią nazw również w powiadomieniach",
        "uk": "виправлення помилки простору імен також за допомогою сповіщень",
        "zh-cn": "修复命名空间通知问题"
      }
    },
    "titleLang": {
      "en": "LoRaWAN",
      "de": "LoRaWAN",
      "ru": "ЛоРаВАН",
      "pt": "LoRaWAN",
      "nl": "LoRaWAN",
      "fr": "LoRaWAN",
      "it": "LoRaWAN",
      "es": "LoRaWAN",
      "pl": "LoRaWAN",
      "uk": "LoRaWAN",
      "zh-cn": "洛拉万"
    },
    "desc": {
      "en": "converts the desired lora gateway data to a ioBroker structure",
      "de": "wandelt die gewünschten Lora-Gateway-Daten in eine ioBroker-Struktur um",
      "ru": "преобразует нужные данные шлюза Lora в структуру ioBroker",
      "pt": "converte os dados desejados do gateway lora em uma estrutura ioBroker",
      "nl": "converteert de gewenste Lora-gatewaygegevens naar een ioBroker-structuur",
      "fr": "convertit les données de la passerelle Lora souhaitées en une structure ioBroker",
      "it": "converte i dati del gateway lora desiderati in una struttura ioBroker",
      "es": "convierte los datos de la puerta de enlace lora deseada a una estructura ioBroker",
      "pl": "konwertuje żądane dane bramy Lora do struktury ioBroker",
      "uk": "перетворює потрібні дані lora gateway на структуру ioBroker",
      "zh-cn": "将所需的lora网关数据转换为ioBroker结构"
    },
    "authors": [
      "BenAhrdt <bsahrdt@gmail.com>"
    ],
    "keywords": [
      "LoRaWAN"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "lorawan.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/BenAhrdt/ioBroker.lorawan/main/admin/lorawan.png",
    "readme": "https://github.com/BenAhrdt/ioBroker.lorawan/blob/main/README.md",
    "loglevel": "info",
    "tier": 2,
    "mode": "daemon",
    "type": "protocols",
    "compact": true,
    "connectionType": "cloud",
    "messagebox": true,
    "dataSource": "push",
    "blockly": true,
    "adminUI": {
      "config": "json",
      "tab": "json"
    },
    "adminTab": {
      "link": "jsonTab.json",
      "singleton": false,
      "name": {
        "en": "LoRaWAN",
        "de": "LoRaWAN"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=7.0.6"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "notifications": [
    {
      "scope": "lorawan",
      "name": {
        "en": "LoRaWAN",
        "de": "LoRaWAN",
        "ru": "LoRaWAN",
        "pt": "LoRaWAN",
        "nl": "LoRaWAN",
        "fr": "LORAWAN",
        "it": "LoRaWAN",
        "es": "LoRaWAN",
        "pl": "LoRaWAN",
        "uk": "Лоравіан",
        "zh-cn": "洛拉万语"
      },
      "description": {
        "en": "These notifications represent news of devices, gateways or LoraWAN Network Services",
        "de": "Diese Benachrichtigungen stellen Nachrichten von Geräten, Gateways oder LoraWAN Network Services dar",
        "ru": "Эти уведомления представляют новости об устройствах, шлюзах или LoraWAN Network Services",
        "pt": "Estas notificações representam notícias de dispositivos, gateways ou serviços de rede LoraWAN",
        "nl": "Deze meldingen vertegenwoordigen nieuws van apparaten, gateways of LoraWAN Network Services",
        "fr": "Ces notifications représentent des nouvelles d'appareils, passerelles ou services réseau LoraWAN",
        "it": "Queste notifiche rappresentano notizie di dispositivi, gateway o LoraWAN Network Services",
        "es": "Estas notificaciones representan noticias de dispositivos, portales o LoraWAN Network Services",
        "pl": "Powiadomienia te stanowią wiadomości o urządzeniach, bramach lub usługach sieciowych LoraWAN",
        "uk": "Ці повідомлення представляють новини пристроїв, шлюзу або LoraWAN",
        "zh-cn": "这些通知代表设备、网关或LoraWAN网络服务的新闻"
      },
      "categories": [
        {
          "category": "Bridge connected",
          "name": {
            "en": "The desired Bridge was connected",
            "de": "Die gewünschte Bridge wurde verbunden",
            "ru": "Желаемый мост был подключен",
            "pt": "A ponte desejada foi conectada",
            "nl": "De gewenste Bridge was aangesloten",
            "fr": "Le pont souhaité a été connecté",
            "it": "Il Bridge desiderato è stato collegato",
            "es": "El puente deseado estaba conectado",
            "pl": "Połączono żądaną Bridge",
            "uk": "З'єднано бажаний міст",
            "zh-cn": "所期望的网桥已连接"
          },
          "severity": "info",
          "description": {
            "en": "The connection to the Bridge changed from disconnected to connected",
            "de": "Die Verbindung zur Bridge hat sich von getrennt zu verbunden geändert",
            "ru": "Соединение с мостом изменилось от отключенного к подключенному",
            "pt": "A conexão com a ponte mudou de desconectada para conectada",
            "nl": "De verbinding met de Bridge veranderde van losgekoppeld naar verbonden",
            "fr": "La connexion au pont est passée de déconnectée à connectée",
            "it": "Il collegamento alla Bridge è cambiato da disconnesso a collegato",
            "es": "La conexión con el puente cambió de desconectado a conectado",
            "pl": "Połączenie z Bridge zmieniło się z odłączonego na podłączony",
            "uk": "З'єднання до мосту змінено з відключеного на підключений",
            "zh-cn": "连接网桥从断开变为已连接"
          },
          "regex": [],
          "limit": 1
        },
        {
          "category": "Bridge disconnected",
          "name": {
            "en": "The desired Bridge was disconnected",
            "de": "Die gewünschte Bridge ist nicht mehr erreichbar",
            "ru": "Желаемый мост был отключен",
            "pt": "A ponte desejada foi desligada",
            "nl": "De gewenste Bridge werd afgesloten",
            "fr": "Le pont souhaité a été déconnecté",
            "it": "Il Bridge desiderato è stato disconnesso",
            "es": "El puente deseado fue desconectado",
            "pl": "Wybrana Bridge została odłączona",
            "uk": "Відключено бажаний міст",
            "zh-cn": "所期望的网桥已断开"
          },
          "severity": "alert",
          "description": {
            "en": "The connection to the Bridge changed from connected to disconnected",
            "de": "Die Verbindung zur Bridge hat sich von verbunden zu getrennt geändert",
            "ru": "Соединение с мостом изменилось от подключенного к отключенному",
            "pt": "A conexão com a ponte mudou de conectada para desconectada",
            "nl": "De verbinding met de Bridge veranderde van verbonden naar losgekoppeld",
            "fr": "La connexion au pont est passée de connectée à déconnectée",
            "it": "La connessione alla Bridge è cambiata da collegata a disconnessa",
            "es": "La conexión con el puente cambió de conectado a desconectado",
            "pl": "Połączenie z Bridge zmieniło się z podłączonego na odłączony",
            "uk": "З'єднання до мосту змінено з підключеного до відключеного",
            "zh-cn": "连接网桥从已连接变为断开"
          },
          "regex": [],
          "limit": 1
        },
        {
          "category": "LoRaWAN Network Service connected",
          "name": {
            "en": "The desired LoRaWAN Network service was connected",
            "de": "Der LoRaWAN Netzwerk Service wurde verbunden",
            "ru": "Желаемый сервис LoRaWAN Network был подключен",
            "pt": "O serviço de rede LoRaWAN desejado foi conectado",
            "nl": "De gewenste LoRaWAN Network service was aangesloten",
            "fr": "Le service de réseau LoRaWAN souhaité était connecté",
            "it": "Il servizio LoRaWAN Network desiderato è stato collegato",
            "es": "El servicio LoRaWAN Network deseado estaba conectado",
            "pl": "Połączono żądaną usługę sieci LoRaWAN",
            "uk": "З'єднано бажаний сервіс LoRaWAN",
            "zh-cn": "所期望的LORAWAN网络服务已连接"
          },
          "severity": "info",
          "description": {
            "en": "The connection to the LoRaWAN Network service changed from disconnected to connected",
            "de": "Die Verbindung zum LoRaWAN Network-Service hat sich von getrennt zu verbunden geändert",
            "ru": "Соединение с сервисом LoRaWAN Network изменилось от отключенного к подключенному",
            "pt": "A conexão com o serviço de rede LoRaWAN mudou de desconectado para conectado",
            "nl": "De verbinding met de LoRaWAN Network service veranderde van losgekoppeld naar verbonden",
            "fr": "La connexion au service réseau LoRaWAN est passée de déconnectée à connectée",
            "it": "Il collegamento al servizio di rete LoRaWAN è cambiato da disconnesso a collegato",
            "es": "La conexión con el servicio LoRaWAN Network cambió de desconectado a conectado",
            "pl": "Połączenie z siecią LoRaWAN zmieniło się z odłączonego na podłączony",
            "uk": "З'єднання до мережі LoRaWAN змінено з відключення",
            "zh-cn": "连接 LoRAWAN 网络服务从断开到连接"
          },
          "regex": [],
          "limit": 1
        },
        {
          "category": "LoRaWAN Network Service disconnected",
          "name": {
            "en": "The desired LoRaWAN Network service was disconnected",
            "de": "Der LoRaWAN Netzwerk Service ist nicht mehr erreichbar",
            "ru": "Желаемый сервис LoRaWAN Network был отключен",
            "pt": "O serviço de rede LoRaWAN desejado foi desligado",
            "nl": "De gewenste LoRaWAN Network service werd afgesloten",
            "fr": "Le service de réseau LoRaWAN souhaité a été déconnecté",
            "it": "Il servizio LoRaWAN Network desiderato è stato disconnesso",
            "es": "El servicio LoRaWAN Network deseado fue desconectado",
            "pl": "Wybrana usługa LoRaWAN Network została odłączona",
            "uk": "Відключено бажаний сервіс мережі LoRaWAN",
            "zh-cn": "想要的LORAWAN网络服务已断开"
          },
          "severity": "alert",
          "description": {
            "en": "The connection to the LoRaWAN Network service changed from connected to disconnected",
            "de": "Die Verbindung zum LoRaWAN-Netzwerk-Service hat sich von verbunden zu getrennt geändert",
            "ru": "Соединение с сервисом LoRaWAN Network изменилось от подключения к отключенному",
            "pt": "A conexão com o serviço de rede LoRaWAN mudou de conectado para desconectado",
            "nl": "De verbinding met de LoRaWAN Network service veranderde van verbonden naar losgekoppeld",
            "fr": "La connexion au service réseau LoRaWAN a changé de connecté à déconnecté",
            "it": "La connessione al servizio di rete LoRaWAN è cambiata da collegato a disconnesso",
            "es": "La conexión con el servicio LoRaWAN Network cambió de conexión a desconexión",
            "pl": "Połączenie z siecią LoRaWAN zmieniło się z podłączonego na odłączony",
            "uk": "З'єднання до мережі LoRaWAN змінено з підключеного до відключення",
            "zh-cn": "连接到 LoRAWAN 网络服务从连接到断开"
          },
          "regex": [],
          "limit": 1
        },
        {
          "category": "LoRaWAN device offline",
          "name": {
            "en": "A LoRaWAN device is offline",
            "de": "Ein LoRaWAN Gerät ist offline",
            "ru": "Устройство LoRaWAN отключено",
            "pt": "Um dispositivo LoRaWAN está offline",
            "nl": "Een LoRaWAN apparaat is offline",
            "fr": "Un périphérique LoRaWAN est hors ligne",
            "it": "Un dispositivo LoRaWAN è offline",
            "es": "Un dispositivo LoRaWAN está fuera de línea",
            "pl": "Urządzenie LoRaWAN jest wyłączone",
            "uk": "Пристрій LoRaWAN автономний",
            "zh-cn": "LORAWAN 设备已下线"
          },
          "severity": "notify",
          "description": {
            "en": "A LoraWAN device has not sended a message for a long time",
            "de": "Ein LoraWAN-Gerät hat lange keine Nachricht gesendet",
            "ru": "Устройство LoraWAN не посылало сообщения в течение длительного времени",
            "pt": "Um dispositivo LoraWAN não enviou uma mensagem por muito tempo",
            "nl": "Een LoraWAN-apparaat heeft al lange tijd geen bericht meer verstuurd",
            "fr": "Un périphérique LoraWAN n'a pas envoyé de message depuis longtemps",
            "it": "Un dispositivo LoraWAN non ha inviato un messaggio per molto tempo",
            "es": "Un dispositivo LoraWAN no ha enviado un mensaje durante mucho tiempo",
            "pl": "Urządzenie LoraWAN nie wysłało wiadomości przez długi czas",
            "uk": "Пристрій LoraWAN не відправляє повідомлення тривалий час",
            "zh-cn": "LoraWAN 设备已经很久没有固定消息了"
          },
          "regex": [],
          "limit": 10
        },
        {
          "category": "Lorawan device back online",
          "name": {
            "en": "A LoRaWAN device is back online",
            "de": "Ein LoRaWAN Gerät ist wieder online",
            "ru": "Устройство LoRaWAN возвращается в онлайн",
            "pt": "Um dispositivo LoRaWAN está de volta online",
            "nl": "Een LoRaWAN apparaat is terug online",
            "fr": "Un appareil LoRaWAN est de retour en ligne",
            "it": "Un dispositivo LoRaWAN è tornato online",
            "es": "Un dispositivo LoRaWAN está de vuelta en línea",
            "pl": "Urządzenie LoRaWAN jest z powrotem online",
            "uk": "Пристрої LoRaWAN звернулися в Інтернеті",
            "zh-cn": "LORAWAN 设备恢复在线"
          },
          "severity": "notify",
          "description": {
            "en": "A LoraWAN device has sended a message and is back online",
            "de": "Ein LoraWAN Gerät hat eine Nachricht gesendet und ist wieder online",
            "ru": "Устройство LoraWAN отправило сообщение и возвращается в онлайн",
            "pt": "Um dispositivo LoraWAN enviou uma mensagem e está de volta online",
            "nl": "Een LoraWAN apparaat heeft een bericht verzonden en is weer online",
            "fr": "Un appareil LoraWAN a envoyé un message et est de retour en ligne",
            "it": "Un dispositivo LoraWAN ha inviato un messaggio ed è tornato online",
            "es": "Un dispositivo LoraWAN ha enviado un mensaje y está de vuelta en línea",
            "pl": "Urządzenie LoraWAN wysłało wiadomość i jest z powrotem online",
            "uk": "Пристрої LoraWAN надсилають повідомлення і повертається онлайн",
            "zh-cn": "一个LoraWAN 设备将消息剪辑并恢复在线"
          },
          "regex": [],
          "limit": 10
        }
      ]
    }
  ],
  "encryptedNative": [
    "password",
    "Bridgepassword"
  ],
  "protectedNative": [
    "password",
    "Bridgepassword"
  ],
  "native": {
    "ipUrl": "eu1.cloud.thethings.network",
    "port": 8883,
    "username": "",
    "password": "",
    "ssl": true,
    "origin": "ttn",
    "notificationActivation": "allNotifications, brdigeConnection, newDiscover, deviceState",
    "downlinkConfig": [],
    "customDecodedJsonActive": false,
    "customConfigurationJsonActive": false,
    "customControlJsonActive": false,
    "customJson": {},
    "BridgeipUrl": "192.168.2.243",
    "Bridgeport": 1883,
    "Bridgeusername": "mqttuser",
    "Bridgepassword": "",
    "Bridgessl": false,
    "BridgeType": "off",
    "EnableRefresh": true,
    "RefreshDiscoveryCronJob": "0 * * * *",
    "BridgeEnum": "",
    "BridgenotificationActivation": "allNotifications, brdigeConnection, newDiscover, deviceState",
    "BridgeDevicenotificationActivation": "allNotifications, brdigeConnection, newDiscover, deviceState",
    "DeviceIdentifiers": [
      {
        "DeviceIdentifier": "usedApplicationName"
      },
      {
        "DeviceIdentifier": "usedDeviceId"
      }
    ],
    "separator": "space",
    "BridgeStateConfig": [
      {
        "Application": "*",
        "Device": "*",
        "Folder": "uplink.decoded",
        "State": "BatteryPercent",
        "publish": true,
        "subscribe": false,
        "exclude": false
      },
      {
        "Application": "*",
        "Device": "*",
        "Folder": "uplink.decoded",
        "State": "Opened",
        "publish": true,
        "subscribe": false,
        "exclude": false
      }
    ],
    "ClimateConfig": []
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": "Downlink files",
        "type": "meta.user"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.bridgeConnection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Bridge connected",
        "type": "boolean",
        "icon": "icons/plug.png",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.discoveredIds",
      "type": "state",
      "common": {
        "role": "json",
        "name": "Information of all discovered States",
        "type": "json",
        "icon": "icons/discover.png",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.publishedIds",
      "type": "state",
      "common": {
        "role": "json",
        "name": "Information of all Published States",
        "type": "json",
        "icon": "icons/discover.png",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.subscribedTopics",
      "type": "state",
      "common": {
        "role": "json",
        "name": "Information of all Subscribed Topics",
        "type": "json",
        "icon": "icons/discover.png",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    },
    {
      "_id": "info.deviceinformations",
      "type": "state",
      "common": {
        "role": "json",
        "name": "Information of all devices",
        "type": "json",
        "icon": "icons/deviceinfo.png",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
